In [1]:
?open

In [3]:
file_obj=open('rf.txt')
type(file_obj)

file

In [4]:
print file_obj.read()

g3tbrsfdtgr
teg
gr

In [19]:
file_obj=open('file_to_writes.txt', 'w')
string = 'jhfghgd'
file_obj.write(string)
file_obj.close()

file_o = open('file_to_writes.txt', 'r')
print file_o.read()

jhfghgd

In [18]:
!cat file_to_writes.txt

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [23]:
a=range(1,20,2)
with open('secondf.txt', 'w') as file_obj:
    file_obj.writelines(el+'\n' for el in map(str, a)и
                       )

In [25]:
import pandas as pd

In [26]:
frame = pd.DataFrame({'numbers':range(1,5), 'chars':['a']*4})
frame

  chars  numbers
0     a        1
1     a        2
2     a        3
3     a        4

In [29]:
frame = pd.read_csv('testf.tsv', header = 0, sep ='\t')
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [39]:
frame.columns
new_new = {'Name':'Валиуллина А.И.', 'Birth':'15.15.2018', 'City':'SPb'}
frame.append(new_new, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6  Валиуллина А.И.  15.15.2018        SPb       NaN

In [39]:
frame.columns
new_new = {'Name':'Валиуллина А.И.', 'Birth':'15.15.2018', 'City':'SPb'}
frame.append(new_new, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6  Валиуллина А.И.  15.15.2018        SPb       NaN

In [40]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [43]:
frame = frame.append(new_new, ignore_index=True)

In [49]:
frame['new_col'] = [1,2,3]*2 + [5 ]

In [50]:
frame

              Name       Birth       City  Position  new_col
0      Иванов А.А.  22.03.1980     Москва       NaN        1
1     Сорокин И.В.  07.08.1965  Волгоград   инженер        2
2       Белов М.М.  13.02.1980     Ростов  менеджер        3
3  Мельникова Д.С.  15.04.1985     Ростов       NaN        1
4      Рыбина Е.П.  19.11.1985     Москва   инженер        2
5     Костров С.О.  31.05.1985     Москва    стажер        3
6  Валиуллина А.И.  15.15.2018        SPb       NaN        5

In [51]:
frame.drop ([1,3], axis=0, inplace=True)

In [53]:
frame.drop ('Birth', axis=1, inplace=True)

In [55]:
frame.to_csv('new_file.csv', sep=',', header=True)

In [56]:
!cat

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.